opends/tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/searchfilter_lessorequalnoname.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 652
SOAPAction: batchRequest

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="Mandatory attribute [name] of [lessOrEqual] element is missing"
   >
<searchRequest 
   dn="uid=abergin,ou=People,dc=siroe,dc=com"
   scope="singleLevel"
   derefAliases="neverDerefAliases">
<filter>
<lessOrEqual><value>Andy</value></lessOrEqual>
</filter>
</searchRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
